Dlubal.TimberPro.CrossSection
Cross-section parameters.

Dlubal.TimberPro.CrossSection.No
Material number

Dlubal.TimberPro.CrossSection.ID
Identifier

Dlubal.TimberPro.CrossSection.Comment
Comment

Dlubal.TimberPro.CrossSection.Tag
Tag

Dlubal.TimberPro.CrossSection.IsValid
Information if the object is valid or not (read only)

Dlubal.TimberPro.CrossSection.MaterialNo
Material number (read only)

Dlubal.TimberPro.CrossSection.Description
Cross-section description

Dlubal.TimberPro.CrossSection.TextID
Language independent text identifier

Dlubal.TimberPro.CrossSection.OriginalTextID
Language independent text identifier of the original cross-section (read only)

Dlubal.TimberPro.CrossSection.Optimize
Optimize cross-section

Dlubal.TimberPro.CrossSection.Status
Status (read only)